# В саду 88n фруктовых деревьев, из них 32n яблони, 22n груши,
# 16n слив и 17n  вишен. В какой системе счисления посчитаны деревья?
# Переведите числа из n-ой системы счисления в десятичную и составьте уравнение.
# for n in range(8, 16):
#     if 8 * n + 8 == (3 * n + 2) + (2 * n + 2) + (n + 6) + (n + 7):
#         print(n)
#


# На вход программе подается натуральное число в десятичной системе счисления.
# Напишите программу, которая переводит его в двоичную, восьмеричную и
# шестнадцатеричную системы счисления.
# a = int(input())
#
# bin_num = bin(a)
# oct_num = oct(a)
# hex_num = hex(a)
#
# print(bin_num[2:])
# print(oct_num[2:])
# print(hex_num[2:].upper())